insert into organizations (address, name, is_government)
values ('355035, Россия, Ставропольский край, город Ставрополь, ул. Мира, 337',
        'Министерство Ставропольского края по делам национальностей и казачества', true);

insert into organizations (address, name, is_government)
values ('355003, Россия, Ставропольский край, город Ставрополь, ул. Ломоносова, 12',
        'Комитет Ставропольского края по делам архивов', true);

insert into organizations (address, name, is_government)
values ('355017, Россия, Ставропольский край, город Ставрополь, ул. Маршала Жукова, 42/311',
        'Министерство здравоохранения Ставропольского края', true);

insert into organizations (address, name, is_government)
values ('355025, Россия, Ставропольский край, город Ставрополь, ул. Ленина, 93',
        'Министерство имущественных отношений Ставропольского края', true);

insert into organizations (address, name, is_government)
values ('355000, Россия, Ставропольский край, город Ставрополь, ул. Булкина, 17',
        'Министерство культуры Ставропольского края', true);

insert into organizations (address, name, is_government)
values ('355017, Россия, Ставропольский край, город Ставрополь, ул.Мира, 337',
        'Министерство сельского хозяйства Ставропольского края', true);

insert into organizations (address, name, is_government)
values ('355002, Россия, Ставропольский край, город Ставрополь, ул. Лермонтова, 206-а., ул. Лермонтова, 181',
        'Министерство труда и социальной защиты населения Ставропольского края', true);

insert into organizations (address, name, is_government)
values ('355035, Россия, Ставропольский край, г. Ставрополь, ул. Пушкина, 25а',
        'Министерство физической культуры и спорта Ставропольского края', true);

insert into organizations (address, name, is_government)
values ('355003, Россия, Ставропольский край, город Ставрополь, ул. Л. Толстого, 39',
        'Министерство финансов Ставропольского края', true);

insert into organizations (address, name, is_government)
values ('355035, Россия, Ставропольский край, город Ставрополь, ул. Мира, 337',
        'Региональная тарифная комиссия Ставропольского края', true);

insert into organizations (address, name, is_government)
values ('355035, Россия, Ставропольский край, город Ставрополь, ул. Мира, 337',
        'Управление ветеринарии Ставропольского края', true);

insert into organizations (address, name, is_government)
values ('355035, Россия, Ставропольский край, город Ставрополь, ул. Спартака, 6',
        'Управление Ставропольского края - Государственная жилищная инспекция', true);

insert into organizations (address, name, is_government)
values ('355003, Россия, Ставропольский край, город Ставрополь, ул. Ломоносова, 3',
        'Министерство образования Ставропольского края', true);

insert into organizations (address, name, is_government)
values ('355017, Россия, Ставропольский край, город Ставрополь, ул. Ленина, 184',
        'Министерство жилищно-коммунального хозяйства Ставропольского края', true);

insert into organizations (address, name, is_government)
values ('355002, Россия, Ставропольский край, город Ставрополь, ул. Лермонтова, 189/1',
        'Управление Ставропольского края по сохранению и государственной охране объектов культурного наследия', true);

insert into organizations (address, name, is_government)
values ('355031, Россия, Ставропольский край, город Ставрополь, проезд Черняховского, 2',
        'Министерство энергетики, промышленности и связи Ставропольского края', true);

insert into organizations (address, name, is_government)
values ('355025, Россия, Ставропольский край, город Ставрополь, ул. Ленина, 293',
        'Министерство экономического развития Ставропольского края', true);

insert into organizations (address, name, is_government)
values ('355006, Россия, Ставропольский край, город Ставрополь, пр. Карла Маркса, 63',
        'Комитет Ставропольского края по государственным закупкам', true);

insert into organizations (address, name, is_government)
values ('355008, Россия, Ставропольский край, город Ставрополь, ул. Войтика, д.10/1',
        'Министерство строительства и архитектуры  Ставропольского края', true);

insert into organizations (address, name, is_government)
values ('355035, Россия, Ставропольский край, город Ставрополь, ул. Голенева, 18',
        'Министерство природных ресурсов и охраны окружающей среды Ставропольского края', true);

insert into organizations (address, name, is_government)
values ('355035, Россия, Ставропольский край, город Ставрополь, ул. Доваторцев, 26, ул. Короленко, 22',
        'Министерство дорожного хозяйства и транспорта Ставропольского края', true);
