-- GOS-WEB
DO
$$
    DECLARE
category_id INT;
BEGIN
SELECT id
INTO category_id
FROM categories
WHERE LOWER(name) LIKE '%госвеб%';

INSERT INTO questions (label, answer, category_id)
VALUES ('При замене редактора не появился доступ',
        'Проблема возникает из-за некорректно поданных данных (СНИЛС, электронная почта)',
        @category_id);

INSERT INTO questions (label, answer, category_id)
VALUES ('Обязательно ли проходить обучение двум редакторам?',
        'Обучение является обязательным для двух редакторов. Сайт не получится перевести в официальный режим в случае не прохождения обучения одного из сотрудников. А заполнение на усмотрение. Второй редактор для взаимозаменяемости (на случай больничного, отпуска и тд.)',
        @category_id);

INSERT INTO questions (label, answer, category_id)
VALUES ('Методические рекомендации', 'https://pos.gosuslugi.ru/docs', @category_id);

INSERT INTO questions (label, answer, category_id)
VALUES ('Возможно ли добавить более двух сотрудников?',
        'Если на платформе «ГосВеб» добавлены уже 2 редактора, то нет. Добавление более двух редакторов возможно после перевода сайта в официальный режим.',
        @category_id);

INSERT INTO questions (label, answer, category_id)
VALUES ('Как добавить сотрудника или организацию?',
        'Для добавления сотрудника или организацию на платформу «ГосВеб» необходимо заполнить прилагаема форму и направить ее на адрес электронной почты botagova@stavregion.ru',
        @category_id);
END
$$;

--POS-WIDGET
DO
$$
    DECLARE
category_id INT;
BEGIN
SELECT id
INTO category_id
FROM categories
WHERE LOWER(name) LIKE '%обратной связи%';

INSERT INTO questions (label, answer, category_id)
VALUES ('Как в личный кабинет организации добавить сотрудника?',
        '1. Шаг 1. Зайдите в личный кабинет администратора по ссылке https://pos.gosuslugi.ru/admin
2. Шаг 2. Выберите свою организацию
3. Шаг 3. Нажмите кнопку «Перейти»
4. Шаг 4: Слева необходимо нажать на вкладку «Учетные записи».
5. Примечание: на этой вкладке отображается реестр пользователей данного ЛКО. Предусмотрена возможность добавлять, редактировать и исключать (архивировать) учетные записи пользователей.
6. Шаг 5. Заполнить данные о пользователе: ФИО, E-mail, телефон и должность в организации.
7. Примечание: E-mail должен быть уникальным
8. Шаг 6 Выбрать роль, которую новый пользователь будет выполнять в системе. Все возможные роли отобразятся в выпадающем списке при нажатии на поле «Выбор роли»
9. Примечание: роли муниципальный уполномоченный и региональный уполномоченный добавляется только через техническую поддержку
10. Шаг 7. После того как вся информация о новом пользователе заполнена, необходимо нажать кнопку «Сохранить». После этого на почту, указанную в форме добавления учетной записи, придет оповещение с уникальной ссылкой – приглашением, по которой необходимо будет перейти, и связать учетную запись ПОС и ЕСИА.',
        @category_id);

INSERT INTO questions (label, answer, category_id)
VALUES ('Как разместить виджет платформы обратной связи?',
        '1. Шаг 1. Зайдите в личный кабинет администратора по ссылке https://pos.gosuslugi.ru/admin
2. Шаг 2. Выберите свою организацию
3. Шаг 3. Нажмите кнопку «Перейти»
4. Шаг 4: Слева необходимо нажать на вкладку «Функционирование ЛКО» выберите один из вариантов оформления баннера (отметка 1).
5. Шаг 5: Нажмите кнопку «Сгенерировать код» (отметка 2).
6. Шаг 6: Скопируйте код электронной формы, нажав кнопку «Скопировать код» (отметка 3). ![](https://domovoy-nsk.ru/var/www/html/dplus/public/cats/3/2/864/nps7axt4mtkj8p1tzmm7kl2os6j1lxot.png)
7. Шаг 7: Вставьте скопированный код электронной формы в файл главной страницы официального сайта (как правило, это index.html)
8. Шаг 8: Проверьте, что электронная форма размещена на первом экране главной страницы. При переходе на главную страницу электронная форма должна отображаться без необходимости прокрутки содержимого страницы.',
        @category_id);

INSERT INTO questions (label, answer, category_id)
VALUES ('Методические рекомендации',
        'https://pos.gosuslugi.ru/docs',
        @category_id);

INSERT INTO questions (label, answer, category_id)
VALUES ('Обращение в техническую поддержку Платформы обратной связи',
        'В случае возникновения технических проблем при работе в Платформе обратной связи необходимо обращаться в техническую поддержку.
Для обращение в службу технической поддержки необходимо направить обращение на электронный адрес:
sd@sc.digital.gov.ru.
Формат заявок в адрес поддержки:
1. Наименование региона
2. Наименование ведомства/организации Инициатора/
3. ИНН и/или ОГРН
4. Наименование системы по которой обращаетесь (ПОС)
5. Описание причины и сути Заявки с приложением скриншотов',
        @category_id);
END
$$;
