-- GOS-WEB
DO
$$
    DECLARE
        category_id INT;
    BEGIN
        SELECT id
        INTO category_id
        FROM categories
        WHERE LOWER(name) LIKE '%госвеб%';

        INSERT INTO questions (label, answer, category_id)
        VALUES ('При замене редактора не появился доступ',
                'Проблема возникает из-за некорректно поданных данных (СНИЛС, электронная почта)',
                @category_id);

        INSERT INTO questions (label, answer, category_id)
        VALUES ('Обязательно ли проходить обучение двум редакторам?',
                'Обучение является обязательным для двух редакторов. Сайт не получится перевести в официальный режим в случае не прохождения обучения одного из сотрудников. А заполнение на усмотрение. Второй редактор для взаимозаменяемости (на случай больничного, отпуска и тд.)',
                @category_id);

        INSERT INTO questions (label, answer, category_id)
        VALUES ('Методические рекомендации', 'https://pos.gosuslugi.ru/docs', @category_id);

        INSERT INTO questions (label, answer, category_id)
        VALUES ('Возможно ли добавить более двух сотрудников?',
                'Если на платформе «ГосВеб» добавлены уже 2 редактора, то нет. Добавление более двух редакторов возможно после перевода сайта в официальный режим.',
                @category_id);

        INSERT INTO questions (label, answer, category_id)
        VALUES ('Как добавить сотрудника или организацию?',
                'Для добавления сотрудника или организацию на платформу «ГосВеб» необходимо заполнить прилагаема форму и направить ее на адрес электронной почты botagova@stavregion.ru',
                @category_id);


    END
$$;

--POS-WIDGET
DO
$$
    DECLARE
        category_id INT;
    BEGIN
        SELECT id
        INTO category_id
        FROM categories
        WHERE LOWER(name) LIKE '%обратной связи%';

        INSERT INTO questions (label, answer, category_id)
        VALUES ('Как в личный кабинет организации добавить сотрудника?',
                '1. Шаг 1. Зайдите в личный кабинет администратора по ссылке https://pos.gosuslugi.ru/admin
        2. Шаг 2. Выберите свою организацию
        3. Шаг 3. Нажмите кнопку «Перейти»
        4. Шаг 4: Слева необходимо нажать на вкладку «Учетные записи».
        5. Примечание: на этой вкладке отображается реестр пользователей данного ЛКО. Предусмотрена возможность добавлять, редактировать и исключать (архивировать) учетные записи пользователей.
        6. Шаг 5. Заполнить данные о пользователе: ФИО, E-mail, телефон и должность в организации.
        7. Примечание: E-mail должен быть уникальным
        8. Шаг 6 Выбрать роль, которую новый пользователь будет выполнять в системе. Все возможные роли отобразятся в выпадающем списке при нажатии на поле «Выбор роли»
        9. Примечание: роли муниципальный уполномоченный и региональный уполномоченный добавляется только через техническую поддержку
        10. Шаг 7. После того как вся информация о новом пользователе заполнена, необходимо нажать кнопку «Сохранить». После этого на почту, указанную в форме добавления учетной записи, придет оповещение с уникальной ссылкой – приглашением, по которой необходимо будет перейти, и связать учетную запись ПОС и ЕСИА.',
                @category_id);

        INSERT INTO questions (label, answer, category_id)
        VALUES ('Как разместить виджет платформы обратной связи?',
                '1. Шаг 1. Зайдите в личный кабинет администратора по ссылке https://pos.gosuslugi.ru/admin
        2. Шаг 2. Выберите свою организацию
        3. Шаг 3. Нажмите кнопку «Перейти»
        4. Шаг 4: Слева необходимо нажать на вкладку «Функционирование ЛКО» выберите один из вариантов оформления баннера (отметка 1).
        5. Шаг 5: Нажмите кнопку «Сгенерировать код» (отметка 2).
        6. Шаг 6: Скопируйте код электронной формы, нажав кнопку «Скопировать код» (отметка 3). ![](https://domovoy-nsk.ru/var/www/html/dplus/public/cats/3/2/864/nps7axt4mtkj8p1tzmm7kl2os6j1lxot.png)
        7. Шаг 7: Вставьте скопированный код электронной формы в файл главной страницы официального сайта (как правило, это index.html)
        8. Шаг 8: Проверьте, что электронная форма размещена на первом экране главной страницы. При переходе на главную страницу электронная форма должна отображаться без необходимости прокрутки содержимого страницы.',
                @category_id);

        INSERT INTO questions (label, answer, category_id)
        VALUES ('Методические рекомендации',
                'https://pos.gosuslugi.ru/docs',
                @category_id);

        INSERT INTO questions (label, answer, category_id)
        VALUES ('Обращение в техническую поддержку Платформы обратной связи',
                'В случае возникновения технических проблем при работе в Платформе обратной связи необходимо обращаться в техническую поддержку.
        Для обращение в службу технической поддержки необходимо направить обращение на электронный адрес:
        sd@sc.digital.gov.ru.
        Формат заявок в адрес поддержки:
        1. Наименование региона
        2. Наименование ведомства/организации Инициатора/
        3. ИНН и/или ОГРН
        4. Наименование системы по которой обращаетесь (ПОС)
        5. Описание причины и сути Заявки с приложением скриншотов',
                @category_id);
    END
$$;

-- GIS-GMP
DO
$$
    DECLARE
        category_id INT;
    BEGIN
        SELECT id
        INTO category_id
        FROM categories
        WHERE LOWER(name) LIKE '%гис гмп%';

        INSERT INTO questions (label, answer, category_id)
        VALUES ('Как получить уникальный регистрационный номер ?',
                'Необходимо написать письмо в адрес министерства энергетики, промышленности и связи Ставропольского края (минпром края) и направить его почтой Российской Федерации или же привезти нарочно в минпром края. Образцы писем можно скачать по ссылке:'
                    '1. Форма письма «Регистрации в ГИС ГМП»
                    https://www.cit-sk.ru/upload/iblock/16e/djafeow30wpquay10kqim5ljyql7t745/%D0%94%D0%BB%D1%8F%20%D1%80%D0%B5%D0%B3%D0%B8%D1%81%D1%82%D1%80%D0%B0%D1%86%D0%B8%D0%B8%20%D0%B2%20%D0%93%D0%98%D0%A1%20%D0%93%D0%9C%D0%9F.DOCX
                    2. Форма письма «Внесение изменений в ГИС ГМП»
                    https://www.cit-sk.ru/upload/iblock/9f8/wxk42v07xnvy5sse6fat32n8d849ai79/%D0%92%D0%BD%D0%B5%D1%81%D0%B5%D0%BD%D0%B8%D0%B5%20%D0%B8%D0%B7%D0%BC%D0%B5%D0%BD%D0%B5%D0%BD%D0%B8%D0%B9%20%D0%B2%20%D0%93%D0%98%D0%A1%20%D0%93%D0%9C%D0%9F.DOCX
                    3. Форма письма «Об исключение из ГИС ГМП»
                    https://www.cit-sk.ru/upload/iblock/a1c/la37u31v1z5q7n3u4fmig419v28iook6/%D0%9E%D0%B1%20%D0%B8%D1%81%D0%BA%D0%BB%D1%8E%D1%87%D0%B5%D0%BD%D0%B8%D0%B5%20%D0%B8%D0%B7%20%D0%93%D0%98%D0%A1%20%D0%93%D0%9C%D0%9F.DOCX',
                @category_id);

        INSERT INTO questions (label, answer, category_id)
        VALUES ('Как узнать уникальный регистрационный номер ?',
                'Для уточнения информации необходимо созвониться с ответственными сотрудниками  министерства энергетики, промышленности и связи Ставропольского края:
                    Еремина Екатерина Алексеевна - инженером
                    отдела информационных систем и организации предоставления государственных услуг
                    министерства энергетики, промышленности
                    и связи Ставропольского края:
                    тел. (8652) 29-56-38

                    Ботагова Валерия Юрьевна - главный специалист отдела информационных систем и организации предоставления государственных услуг
                    министерства энергетики, промышленности
                    и связи Ставропольского края:
                    тел. (8652) 29-55-93',
                @category_id);
    END
$$;

-- GIS-PGS
DO
$$
    DECLARE
        category_id INT;
    BEGIN
        SELECT id
        INTO category_id
        FROM categories
        WHERE LOWER(name) LIKE '%пгс%';

        INSERT INTO questions (label, answer, category_id)
        VALUES ('Что делать не работает ПГС? Ошибки при входе в ПГС?',
                ' Для того чтобы устранить ошибки при входе в ПГС необходимо сделать скриншот экрана с ошибкой, направить его и наиболее полное описание проблемы на адрес электронной почты федерального ситуационного центра Правительства РФ: sd@sc.digital.gov.ru, или оставить заявку на сайте федерального ситуационного центра Правительства РФ: https://sc.digital.gov.ru',
                @category_id);

        INSERT INTO questions (label, answer, category_id)
        VALUES ('Как настроить доступ сотрудникам в ПГС ?',
                'Настроить доступ сотрудникам в ПГС могут Администраторы профиля организации в ЕСИА. С инструкцией можно ознакомится по ссылке https://drive.rtlabs.ru/d/s/nzFM4REceNS9TjRb8vLNbXI5szHHLUas/IMbyUrAaduS1vgtsYVDwzL4J00ceJHBV-3L_A1ywWZwk#file_id=676690299115843763',
                @category_id);

        INSERT INTO questions (label, answer, category_id)
        VALUES ('На какие роли и в чем их отличие можно назначать сотрудников в ПГС?',
                'Роли бывают следующие:
                ·	Регистратор/Назначающий регистратор
                ·	Специалист/Назначающий специалист
                ·	Должностное лицо
                ·	Наблюдатель
                Более подробную информацию по ролям можно получить по https://www.admin-smolensk.ru/files/1490/rolevaya_model_v_pgs_2_0_.docx',
                @category_id);

        INSERT INTO questions (label, answer, category_id)
        VALUES ('Где я могу получить инструкцию по работе в ПГС?',
                'Инструкция по работе с ПГС находится по ссылке https://drive.rtlabs.ru/d/s/nzFM4REceNS9TjRb8vLNbXI5szHHLUas/IMbyUrAaduS1vgtsYVDwzL4J00ceJHBV-3L_A1ywWZwk#file_id=676691168309850796',
                @category_id);

        INSERT INTO questions (label, answer, category_id)
        VALUES ('Куда заходить чтобы войти в ПГС?',
                'Для входа в ПГС воспользуйтесь ссылкой https://pgs2.gosuslugi.ru/microws. Для прохождения авторизации необходимо выбрать вход через ЕСИА и авторизоваться под учетной записью сотрудника с необходимой ролью',
                @category_id);

        INSERT INTO questions (label, answer, category_id)
        VALUES ('Что такое ЕЛК и чем обосновывается направления статусов в ЕЛК на ЕПГУ?',
                'ями) статусов и результатов предоставления услуг вне зависимости от способов Механизм единого личного кабинета (ЕЛК) предполагает возможность направления органами (организаципредоставления услуги и получения результата.
                Статусы и результаты предоставления услуг направляют:
                ·	федеральные органы исполнительной власти, предоставляющие государственные услуги;
                ·	органы государственных внебюджетных фондов, предоставляющие государственные услуги;
                ·	исполнительные органы государственной власти субъектов РФ, предоставляющие государственные услуги;
                ·	органы местного самоуправления, предоставляющие государственные услуги в сфере переданных полномочий;
                ·	органы местного самоуправления, предоставляющие муниципальные услуги;
                ·	государственные, муниципальные учреждения и иные организации, предоставляющие услуги в рамках государственного или муниципального задания (заказа);
                ·	МФЦ, на которые нормативными правовыми актами возложена функция по предоставлению государственных (муниципальных) услуг в полном объеме, включая принятие решения о предоставлении (отказе в предоставлении) услуги, составление и выдачу результата предоставления услуги.
                Нормативное обоснование направления статусов по заявлениям в ЕЛК:
                ·	Федеральный закон от 27 июля 2010 г. № 210-ФЗ [URL] http://government.ru/docs/all/99643/
                ·	Распоряжение Правительства Российской Федерации от 6 сентября 2021 г. № 2470-р [URL] http://static.government.ru/media/acts/files/1202109080016.pdf
                ·	Постановление Правительства Российской Федерации от 1 марта 2022 г. № 277 [URL] http://static.government.ru/media/acts/files/1202203030014.pdf',
                @category_id);

        INSERT INTO questions (label, answer, category_id)
        VALUES ('Как работать с модулем ПГС очный прием для направления статусов в ЕЛК?',
                'Подробная инструкция по работе с модулем «Очный прием» в ПГС находится по ссылке. [URL] https://disk.yandex.ru/i/c_OV8RQjFCA_gw',
                @category_id);

        INSERT INTO questions (label, answer, category_id)
        VALUES ('Что такое Визуальный конструктор услуг? Нормативное обоснование по ВКУ?',
                'Визуальный конструктор услуг (далее ВКУ) – это автоматизированная система, состоящая из набора сервисов, отвечающих за разработку, наполнение и публикацию новых услуг на ЕПГУ.
                ВКУ предназначен для разработки ИФ услуг с целью их последующей публикации на тестовой и продуктивной средах ЕПГУ.
                В рамках работы в ВКУ автоматизируются и упрощаются следующие процессы:
                создание версий услуг - разработка сценариев услуг происходит при помощи визуального интерфейса, автоматизируется разработка управляющего JSON файла;
                проверка валидности разработанного JSON файла;
                публикация разрабатываемой услуги на тестовую среду ЕПГУ (пользователь может публиковать разрабатываемую услугу из интерфейса ВКУ);
                процедура проверки разрабатываемых услуг.
                Нормативное обоснование:
                3 сентября 2022 г. было выпущено Постановление Правительства № 1555, которое регламентирует разработку услуг в подсистеме ЕПГУ — Конструкторе услуг.
                Также, были разработаны технические требования, которые раскрывают положения Постановления Правительства.
                ·	Постановление Правительства от 3 сентября 2022 г. № 1555 [URL] https://info.gosuslugi.ru/upload/medialibrary/0fb/5csnyf1iuxpjwgiq3vj4cphwnc9ehrnw/0001202209070011.pdf
                ·	Технические требования (версия 1.4.2 от 17.08.2023) [URL] https://info.gosuslugi.ru/upload/medialibrary/a82/y4yhzwsiy8lpx5zb3p6ewy9h0enkz0bl/TT_Konstruktor_1_4_2.docx',
                @category_id);

        INSERT INTO questions (label, answer, category_id)
        VALUES ('Какими возможностями обладает визуальный конструктор услуг?',
                '·	создавать услуги;
                ·	создавать и настраивать версии услуг, в том числе:
                ·	экраны версии услуги;
                ·	компоненты на экране;
                ·	свойства компонент и экранов;
                ·	правила переходов между экранами;
                ·	функциональные компоненты, используемые для заполнения черновика заявления, но не отображающиеся конечному пользователю услуги;
                ·	создавать и настраивать шаблоны услуг;
                ·	создавать и настраивать шаблоны экранов;
                ·	загружать управляющие файлы (VM-шаблоны);
                ·	публиковать разрабатываемую услугу на тестовой среде;
                ·	публиковать отдельные экраны разрабатываемой версии услуги на тестовой среде;
                ·	проводить тестирование опубликованной ИФ услуги;
                ·	осуществлять следующие проверки:
                ·	корректность заполнения настроек экранов и компонентов версии услуги;
                ·	наличие используемых в управляющих шаблонах ссылок на компоненты в версии услуги',
                @category_id);

        INSERT INTO questions (label, answer, category_id)
        VALUES ('Где я могу посмотреть дополнительную информацию по ВКУ?',
                'У конструктора услуг есть канал в телеграмме, на котором оперативно публикуется вся информация, касающаяся проекта. Присоединиться к каналу можно по ссылке. [URL] http://t.me/+h732pPf9lmU5NGJi',
                @category_id);

        INSERT INTO questions (label, answer, category_id)
        VALUES ('Какими возможностями обладает визуальный конструктор услуг?',
                '·	создавать услуги;
                ·	создавать и настраивать версии услуг, в том числе:
                ·	экраны версии услуги;
                ·	компоненты на экране;
                ·	свойства компонент и экранов;
                ·	правила переходов между экранами;
                ·	функциональные компоненты, используемые для заполнения черновика заявления, но не отображающиеся конечному пользователю услуги;
                ·	создавать и настраивать шаблоны услуг;
                ·	создавать и настраивать шаблоны экранов;
                ·	загружать управляющие файлы (VM-шаблоны);
                ·	публиковать разрабатываемую услугу на тестовой среде;
                ·	публиковать отдельные экраны разрабатываемой версии услуги на тестовой среде;
                ·	проводить тестирование опубликованной ИФ услуги;
                ·	осуществлять следующие проверки:
                ·	корректность заполнения настроек экранов и компонентов версии услуги;
                ·	наличие используемых в управляющих шаблонах ссылок на компоненты в версии услуги',
                @category_id);

        INSERT INTO questions (label, answer, category_id)
        VALUES ('Где я могу посмотреть обучающие материалы по работе с ВКУ?',
                'Полный курс обучающих материалов находится по ссылке [URL] https://info.gosuslugi.ru/sections/%D0%9A%D0%BE%D0%BD%D1%81%D1%82%D1%80%D1%83%D0%BA%D1%82%D0%BE%D1%80_%D1%83%D1%81%D0%BB%D1%83%D0%B3_%D0%95%D0%9F%D0%93%D0%A3/',
                @category_id);

        INSERT INTO questions (label, answer, category_id)
        VALUES ('Куда мне нужно зайти чтобы попасть в визуальный конструктор услуг?',
                'Для входа в визуальный конструктор услуг воспользуйтесь ссылкой [URL] https://vku.test.gosuslugi.ru/',
                @category_id);

        INSERT INTO questions (label, answer, category_id)
        VALUES ('Куда мне нужно зайти чтобы попасть в визуальный конструктор услуг?',
                '·	получение учетной записи разработчика и тестового пользователя, регистрация сервисного кода услуги;
                ·	конструирование услуги в среде разработки с помощью визуального редактора, тестирование и согласование с заказчиком;
                ·	разработка VM-шаблонов;
                ·	публикация услуги в тестовую среду;
                ·	настройка взаимодействия с информационной системой ведомства, оказывающего услугу;
                ·	публикация услуги в продуктивную среду.',
                @category_id);

        INSERT INTO questions (label, answer, category_id)
        VALUES ('Куда направлять заявку для доступа к ВКУ?? Как выглядит форма заявки для получения доступа к ВКУ?',
                'заявку для доступа к ВКУ необходимо направлять на адрес электронной почты федерального ситуационного центра Правительства РФ: sd@sc.digital.gov.ru Форма заявки выглядит следующим образом:' ||
                'Ведомство:
                 ОГРН организации:
                Соглашение/Услуга:	Поддержка ИС ИЭП.
                Тип запроса:	Регламентная процедура.
                Система ИЭП:	ВКУ ЕПГУ.
                Тип регламентной процедуры:	Предоставление доступа.
                Тема:	Произвольно
                Описание:	Ответственный:
                ФИО:
                Тел.рабочий:
                Тел.контактный:
                Эл.почта рабочая:
                Эл.почта госуслуги: ',
                @category_id);
    END
$$;


-- TOR-KND
DO
$$
    DECLARE
        category_id INT;
    BEGIN
        SELECT id
        INTO category_id
        FROM categories
        WHERE LOWER(name) LIKE '%гис тор кнд%';

        INSERT INTO questions (label, answer, category_id)
        VALUES ('Подскажите пожалуйста контактную информацию службы технической поддержки ГИС ТОР КНД',
                'Контакты службы технической поддержки
                Адрес электронной почты: kndsupport@voskhod.ru
                Телефон: +7 (495) 788-85-71
                Режим работы: прием звонков осуществляется с 07:00 до 18:00 по МСК в рабочие дни, обработка писем по почте производится в автоматическом режиме 24х7
                Служба технической поддержки предназначена исключительно для поддержки пользователей ГИС ТОР КНД и ФГИС РОТ.
                Общие требования по оформлению обращений в службу технической поддержки ГИС ТОР КНД
                При направлении обращений в Службу технической поддержки необходимо указывать следующие сведения:
                1.	ФИО и Роль пользователя, под которым возникает ошибка
                2.	Полное наименование организации и региона РФ
                3.	Пошаговое описание ситуации
                4.	Иллюстрирующие пошаговые скриншоты
                5.	Cписки пользователей для заведения Учетных Записей необходимо направлять в редактируемом формате
                Описание процесса регистрации обращения
                После того, как Вы обратились в службу технической поддержки, оператор производит регистрацию Вашего обращения в Ситуационном центре ГИС ТОР КНД. По факту регистрации обращения Вы получите почтовое оповещение. Иногда, к сожалению, наши почтовые оповещения могут попасть в папку «спам» или быть отклонены системой защиты информации Вашего почтового сервера. В этом случае необходимо позвонить по телефону СТП +7 (495) 788-85-71 и уточнить статус Вашего обращения, а также обратиться к администраторам Вашей почтовой службы, чтобы решить проблему недоставки наших почтовых оповещений.
                ',
                @category_id);

        INSERT INTO questions (label, answer, category_id)
        VALUES ('Как подключиться к каналу «ПЛАТФОРМА КНД» в telegram?',
                'Перейти по ссылке: https://t.me/torknd [URL] https://t.me/torknd
                В случае подключения в telegram к региональному центру координации «ТОР 2.0. Ставрополь» необходимо обратиться в министерство энергетики, промышленности и связи Ставропольского края',
                @category_id);

        INSERT INTO questions (label, answer, category_id)
        VALUES ('Каким региональным НПА регулируется использование ГИС ТОР КНД в Ставропольском крае',
                'Постановление Губернатора Ставропольского края от 05 июня 2023 г.
№ 272 «О некоторых мерах по организации использования государственной информационной системы «Типовое облачное решение по автоматизации контрольной (надзорной) деятельности» в Ставропольском крае»',
                @category_id);

        INSERT INTO questions (label, answer, category_id)
        VALUES ('Как создать новую учетную запись в ГИС ТОР КНД (добавить/исключить/сменить данные пользователя)?',
                'После того, как Вы обратились в службу технической поддержки, оператор производит регистрацию Вашего обращения в Ситуационном центре ГИС ТОР КНД. По факту регистрации обращения Вы получите почтовое оповещение. Иногда, к сожалению, наши почтовые оповещения могут попасть в папку «спам» или быть отклонены системой защиты информации Вашего почтового сервера. В этом случае необходимо позвонить по телефону СТП +7 (495) 788-85-71 и уточнить статус Вашего обращения, а также обратиться к администраторам Вашей почтовой службы, чтобы решить проблему недоставки наших почтовых оповещений.',
                @category_id);

        INSERT INTO questions (label, answer, category_id)
        VALUES ('Как КНО начать работу в ГИС ТОР КНД?',
                'Для предоставления доступа к указанной платформе и создания учетных записей:
Орган исполнительной власти Ставропольского края или подведомственное ему государственное учреждение Ставропольского края, осуществляющее государственный контроль (надзор), направляет письмо, содержащее информацию о должностном лице пользователя, предусмотренную Приложением № 1 к Правилам пользования государственной информационной системой «Типовое облачное решение по автоматизации контрольной (надзорной) деятельности», утвержденным приказом Министерства цифрового развития, связи и массовых коммуникаций Российской Федерации от 30.09.2022 № 730 (далее – заявка), в министерство энергетики, промышленности и связи Ставропольского края для получения (прекращения) доступа к государственной информационной системе
Форму заявки можно скачать https://knd.gov.ru/document/connect',
                @category_id);
    END
$$;
